package ru.kourilenko;

public class Consts {
    public static final String help = "Добрый день!\n" +
            "Рада, что вы решили воспользоваться сией реализацией Нормального Алгоритма Маркова.\n" +
            "Данную программу вы можете запускать без параметров, с одним параметром, и с двумя параметрами.\n" +
            "Если вы запустите ее без параметров, она запросит имя файла с инструкциями для машины Маркова, \n" +
            "и будет запрашивать строку на обработку до выхода из програмы при помощи слова 'exit'\n" +
            "Запустить программу вы можете с одним параметром -dialog, тогда она запуститься в очень удобном для вас диалоговом режиме,\n" +
            "где вы сможете перенастраивать машину Маркова и обрабатывать любое количество строк без перезапуска программы.\n" +
            "Так же вы можете запустить программу с одним параметром-названием файла с инструкциями,\n" +
            "тогда она будет будет, аналогично первому вариснту, запрашивать строку на обработку до выхода из програмы при помощи слова 'exit'\n" +
            "И последний вариант, вы можете сразу запустить програму указав имя файла с инструкциями и введя строку, для обработки.\n" +
            "А Вова Макаренко - кот.";
}
